OdIfcDeviationParams.setMaxPerCircle(System.UInt16)
\details
Sets a new maximum number of circle segments.
\param maxPerCircle [in] A new maximum quantity of circle segments to be set.

OdIfcDeviationParams.getMaxPerCircle
\details
Retrieves the current maximum number of circle segments.
\returns Returns an unsigned 16-bit integer value that represents the current maximum quantity of circle segments.

OdIfcDeviationParams.setMinPerCircle(System.UInt16)
\details
Sets a new minimum number of circle segments.
\param minPerCircle [in] A new minimum quantity of circle segments to be set.

OdIfcDeviationParams.getMinPerCircle
\details
Retrieves the current minimum number of circle segments.
\returns Returns an unsigned 16-bit integer value that represents the current minimum quantity of circle segments.

OdIfcDeviationParams.setDeviation(System.Double)
\details
Sets a new deviation value for the parameters set.
\param deviation [in] A new deviation value to be set.

OdIfcDeviationParams.getDeviation
\details
Retrieves the current deviation value.
\returns Returns a double value that represents the current deviation value.

OdIfcDeviationParams.#ctor(System.Double,System.UInt16,System.UInt16)
\details
Creates a new set of deviation parameters with the specified values.
\param deviation    [in] A deviation value.
\param minPerCircle [in] A minimum number of segments to divide the circle into.
\param maxPerCircle  [in] A maximum number of segments to divide the circle into.

OdIfcDeviationParams
\details
A class that implements working with IFC deviation parameters.